
  {

    "sunSign": {
    
    "Aries": "Aries people are bold, energetic, full of vitality, charismatic, fun, lively, passionate, and driven by their hearts and desires. They have to feel ~all in~ on something to succeed in it, but, when they are, they are unstoppable. They thrive on competition, challenges, targets, and rivalry. Aries have a very warm and passionate nature. Their Mars ruler makes them competitive and full-on too. They have a big presence, they can light up a room. And, mostly, they’re lovely to be around because they genuinely care about other people.",
    "Taurus": "Typical sun in Taurus traits include being hard-headed, down-to-earth, tenacious, reliable, loyal, and sensual. All of these characteristics mirror themes covered by the Second House of Self-Worth and Income, which Taurus rules.Taureans are intensely physical creatures - they revere the pleasures of the material world (rather than imaginative capers or fantasy stories.) So: food, drink, chilling, pampering, shopping, sex. That activity-combo is what makes Taurus tick.And, they can have difficulty finding the off button for the aforementioned. ",
    "Gemini": "Geminis are very intelligent and pick up knowledge quickly. They are perceptive, analytical, and often very funny. They have an unreserved, childlike curiosity, always asking new questions. Geminis have an uncanny ability to size up a person's character in a matter of seconds, even if they only just met them.Geminis are afraid of being alone. This is why they tend to have large social circles and always have a companion. It’s not that Geminis aren’t creative,it’s that they’re afraid of the power of their own imagination.",
    "Cancer": "Cancer individuals are known for their deep emotional intelligence. They are nurturing, protective, and incredibly empathetic. Family and home are of utmost importance to them. Cancerians are intuitive and have a natural ability to connect with others on an emotional level. They may appear reserved at first, but once you break through their protective shell, you find a loyal and caring friend. Like the Moon, Cancer's ruling planet, they experience constant emotional phases.",
    "Leo": "Leos are confident, ambitious, and natural leaders. They have a magnetic personality and a strong desire to be recognized and appreciated. Leos are creative and passionate individuals who thrive in the spotlight. They are generous and love to shower their loved ones with affection. However, Leos can be a bit prideful, and their ego may need careful handling. They are ruled by the Sun, and like the Sun, they bring warmth and light wherever they go.",
    "Virgo": "Virgos are detail-oriented, practical, and analytical. They have a keen sense of organization and a strong work ethic. Virgos are often perfectionists, striving for excellence in everything they do. They are reliable and loyal friends, always ready to lend a helping hand. Despite their reserved nature, Virgos have a witty and clever sense of humor. They are ruled by Mercury, the planet of communication, which contributes to their sharp intellect.",
    "Libra": "Libras are known for their charm, diplomacy, and love of beauty. They have a natural ability to create harmony in their surroundings and relationships. Librans are social beings who value connections and partnerships. They have a deep sense of justice and fairness and can be quite empathetic. Ruled by Venus, the planet of love and aesthetics, Libras have a strong appreciation for art, culture, and the finer things in life.",
    "Scorpio": "Scorpios are intense, mysterious, and passionate individuals. They have a magnetic allure and a probing, analytical mind. Scorpios are determined and focused, often unafraid to delve into the depths of life's mysteries. Loyalty is paramount to them, and they can be fiercely protective of their loved ones. While Scorpios may have a reputation for secrecy, they also have a transformative and healing nature. Pluto, the planet of transformation, rules Scorpio.",
    "Sagittarius": "Sagittarians are adventurous, optimistic, and free-spirited. They have a love for exploration and a deep curiosity about the world. Sagittarius individuals are known for their honesty and straightforwardness. They enjoy philosophical discussions and have a keen sense of humor. While they may be perceived as footloose and fancy-free, Sagittarians are also wise and philosophical. Ruled by Jupiter, the planet of expansion, they seek knowledge and growth.",
    "Capricorn": "Capricorns are disciplined, ambitious, and responsible individuals. They have a strong work ethic and a practical approach to life. Capricorns are goal-oriented and often climb the ladder of success with determination. While they may appear reserved, they are reliable and loyal friends. Capricorns value tradition and are grounded in reality. Saturn, the planet of structure and discipline, rules Capricorn, contributing to their sense of order and responsibility.",
    "Aquarius": "Aquarians are innovative, independent, and forward-thinking individuals. They have a strong sense of individuality and a passion for making the world a better place. Aquarians are known for their intelligence and progressive ideas. They are open-minded and enjoy socializing with a diverse group of people. While they may seem detached at times, Aquarians are deeply humanitarian and value equality. Uranus, the planet of innovation, rules Aquarius.",
    "Pisces": "Pisceans are intuitive, compassionate, and artistic individuals. They have a deep connection to their emotions and the world around them. Pisceans are dreamers with a vivid imagination and a strong sense of empathy. They are adaptable and often take on the emotions of those around them. Pisces individuals are creative and may excel in artistic pursuits. Ruled by Neptune, the planet of inspiration and dreams, Pisceans have a mystical and ethereal quality."
    
  },

  "moonSign": {

    "Aries": "Aries or MESH (मेष) people are bold, energetic, full of vitality, charismatic, fun, lively, passionate, and driven by their hearts and desires. They have to feel ~all in~ on something to succeed in it, but, when they are, they are unstoppable. They thrive on competition, challenges, targets, and rivalry. Aries have a very warm and passionate nature. Their Mars ruler makes them competitive and full-on too. They have a big presence, they can light up a room. And, mostly, they’re lovely to be around because they genuinely care about other people. Ideally your name should start with -> A, L, E, I, O",
    "Taurus": "Vrushabh (वृषभ) is Typical sun in Taurus traits include being hard-headed, down-to-earth, tenacious, reliable, loyal, and sensual. All of these characteristics mirror themes covered by the Second House of Self-Worth and Income, which Taurus rules.Taureans are intensely physical creatures - they revere the pleasures of the material world (rather than imaginative capers or fantasy stories.) So: food, drink, chilling, pampering, shopping, sex. That activity-combo is what makes Taurus tick.And, they can have difficulty finding the off button for the aforementioned. Ideally your name should start with -> B, V, U, W",
    "Gemini": "Mithun (मिथुन) Geminis are very intelligent and pick up knowledge quickly. They are perceptive, analytical, and often very funny. They have an unreserved, childlike curiosity, always asking new questions. Geminis have an uncanny ability to size up a person's character in a matter of seconds, even if they only just met them.Geminis are afraid of being alone. This is why they tend to have large social circles and always have a companion. It’s not that Geminis aren’t creative,it’s that they’re afraid of the power of their own imagination. Ideally your name should start with -> K, CHH, GH, Q, C",
    "Cancer": "Kark (कर्क ) Cancer individuals are known for their deep emotional intelligence. They are nurturing, protective, and incredibly empathetic. Family and home are of utmost importance to them. Cancerians are intuitive and have a natural ability to connect with others on an emotional level. They may appear reserved at first, but once you break through their protective shell, you find a loyal and caring friend. Like the Moon, Cancer's ruling planet, they experience constant emotional phases.Ideally your name should start with -> DD, H",
    "Leo": "Simha (सिंह) Leos are confident, ambitious, and natural leaders. They have a magnetic personality and a strong desire to be recognized and appreciated. Leos are creative and passionate individuals who thrive in the spotlight. They are generous and love to shower their loved ones with affection. However, Leos can be a bit prideful, and their ego may need careful handling. They are ruled by the Sun, and like the Sun, they bring warmth and light wherever they go. Ideally your name should start with -> M, TT",
    "Virgo": "Kanya (कन्या) Virgos are detail-oriented, practical, and analytical. They have a keen sense of organization and a strong work ethic. Virgos are often perfectionists, striving for excellence in everything they do. They are reliable and loyal friends, always ready to lend a helping hand. Despite their reserved nature, Virgos have a witty and clever sense of humor. They are ruled by Mercury, the planet of communication, which contributes to their sharp intellect. Ideally your name should start with -> P, THA",
    "Libra": "Tula (तुला) Libras are known for their charm, diplomacy, and love of beauty. They have a natural ability to create harmony in their surroundings and relationships. Librans are social beings who value connections and partnerships. They have a deep sense of justice and fairness and can be quite empathetic. Ruled by Venus, the planet of love and aesthetics, Libras have a strong appreciation for art, culture, and the finer things in life. Ideally your name should start with -> R, T",
    "Scorpio": "Vrushchick (वृश्चिक) Scorpios are intense, mysterious, and passionate individuals. They have a magnetic allure and a probing, analytical mind. Scorpios are determined and focused, often unafraid to delve into the depths of life's mysteries. Loyalty is paramount to them, and they can be fiercely protective of their loved ones. While Scorpios may have a reputation for secrecy, they also have a transformative and healing nature. Pluto, the planet of transformation, rules Scorpio. Ideally your name should start with -> N, Y",
    "Sagittarius": "Dhanu (धनु) Sagittarians are adventurous, optimistic, and free-spirited. They have a love for exploration and a deep curiosity about the world. Sagittarius individuals are known for their honesty and straightforwardness. They enjoy philosophical discussions and have a keen sense of humor. While they may be perceived as footloose and fancy-free, Sagittarians are also wise and philosophical. Ruled by Jupiter, the planet of expansion, they seek knowledge and growth. Ideally your name should start with -> BH, F, DH,",
    "Capricorn": "Makar (मकर) Capricorns are disciplined, ambitious, and responsible individuals. They have a strong work ethic and a practical approach to life. Capricorns are goal-oriented and often climb the ladder of success with determination. While they may appear reserved, they are reliable and loyal friends. Capricorns value tradition and are grounded in reality. Saturn, the planet of structure and discipline, rules Capricorn, contributing to their sense of order and responsibility. Ideally your name should start with -> KH, J",
    "Aquarius": "Kumbh (कुम्भ) Aquarians are innovative, independent, and forward-thinking individuals. They have a strong sense of individuality and a passion for making the world a better place. Aquarians are known for their intelligence and progressive ideas. They are open-minded and enjoy socializing with a diverse group of people. While they may seem detached at times, Aquarians are deeply humanitarian and value equality. Uranus, the planet of innovation, rules Aquarius. Ideally your name should start with -> G, S, Sh",
    "Pisces": "Meen (मीन) Pisceans are intuitive, compassionate, and artistic individuals. They have a deep connection to their emotions and the world around them. Pisceans are dreamers with a vivid imagination and a strong sense of empathy. They are adaptable and often take on the emotions of those around them. Pisces individuals are creative and may excel in artistic pursuits. Ruled by Neptune, the planet of inspiration and dreams, Pisceans have a mystical and ethereal quality. Ideally your name should start with -> D, CH, Z, TH"
  }
}


